In [7]:
cur.execute('Use amaze')

In [2]:
import mysql.connector as sqltor
mycon=sqltor.connect(host="localhost",user="root",passwd="Root@123")
cur = mycon.cursor()
#cur.execute('Create database amaze')

cur.execute('use amaze')
cur.execute('insert into stars values(1,"sun"), (2, "proxima"), (3, "Lynx"), (4, "Scorpius")')
cur.execute('select*from stars')

for i in cur:
    print(i)

(1, 'sun')
(2, 'proxima')
(3, 'Lynx')
(4, 'Scorpius')

In [22]:
import mysql.connector as sqltor
mycon=sqltor.connect(host="localhost",user="root",passwd="Root@123")
cur = mycon.cursor()
#cur.execute('Create database amaze')

cur.execute('Use club')
#cur.execute('create table member(M_ID varchar(20), Name char(20), Activity char(20))')
cur.execute('insert into member values("M1001", "Amina", "GYM"), ("M1002", "Pratik", "GYM"), ("M1003", "Simon", "SWIMMING")')
cur.execute('Select * from member')
for i in cur:
    print(i)

('M1001', 'Amina', 'GYM')
('M1002', 'Pratik', 'GYM')
('M1003', 'Simon', 'SWIMMING')

In [26]:
l = []
m = input('Enter M_ID: ')
s = 'select * from member where M_ID=%s'
l.append(m)
cur.execute(s,l)
v = cur.fetchall()
for j in v:
    print(j)

Enter M_ID: m1001
('M1001', 'Amina', 'GYM')

In [23]:
n = input('Enter name: ')
s = 'select * from member where name="%s"'%(n,)
cur.execute(s)
v = cur.fetchall()
for j in v:
    print(j)

Enter name: pratik
('M1002', 'Pratik', 'GYM')

In [24]:
m = input('Enter M_ID: ')
s = 'select * from member where M_ID="%s"'%(m,)
cur.execute(s)
v = cur.fetchall()
for j in v:
    print(j)

Enter M_ID: m1001
('M1001', 'Amina', 'GYM')

In [31]:
mycon=sqltor.connect(host="localhost",user="root",passwd="Root@123")
cur = mycon.cursor()
cur.execute('Use club')
id1 = input('ID: ')
name = input('Name: ')
act = input('Activity: ')
v = 'insert into member(M_ID, Name, Activity) values("%s", "%s", "%s")'%(id1, name, act)
cur.execute(v)
mycon.commit()
cur.execute('select * from member')
for j in cur:
    print(j)

ID: 101
Name: Amina
Activity: GYM
('101', 'Amina', 'GYM')

In [32]:
cur.execute('insert into member values("102", "Pratik", "GYM"), ("103", "Simon", "SWIMMING")')
mycon.commit()
cur.execute('Select * from member')
for i in cur:
    print(i)

('101', 'Amina', 'GYM')
('102', 'Pratik', 'GYM')
('103', 'Simon', 'SWIMMING')

In [15]:
import mysql.connector as sqltor
mycon=sqltor.connect(host="localhost",user="root",passwd="Root@123")
cur = mycon.cursor()
cur.execute('Use club')
#cur.execute('create table movie(MovieID int, MovieName char(20), Category char(20), ReleaseDate Date, ProductionCost int, BusinessCost int)')

for x in range(2):
    stuno = input('Movie ID: ')
    name = input('Movie Name: ')
    game = input('Category: ')
    grade1 = input('Release Date: ')
    supw = input('Production Cost: ')
    grade2 = input('Business Cost: ')
    if grade1 == '':
        grade1 = null
    print('')
    v = 'insert into movie(MovieID, MovieName, Category, ReleaseDate, ProductionCost, BusinessCost) values("{}", "{}", "{}", "{}", "{}", "{}")'.format(stuno, name, game, grade1, supw, grade2)
    cur.execute(v)
    mycon.commit()
cur.execute('select * from movie')
for j in cur:
    print(j)

Movie ID: 005
Movie Name: Telgu_Movie
Category: Action
Release Date:
Production Cost: 100000
Business Cost:

DataError: 1292 (22007): Incorrect date value: 'None' for column 'ReleaseDate' at row 1

In [11]:
cur.execute('select * from movie')
for j in cur:
    print(j)

(1, 'Hindi_Movie', 'Musical', datetime.date(2018, 4, 23), 124500, 130000)
(2, 'Tamil_Movie', 'Action', datetime.date(2016, 5, 17), 112000, 118000)
(3, 'English_Movie', 'Horror', datetime.date(2017, 8, 6), 245000, 360000)
(4, 'Bengali_Movie', 'Adventure', datetime.date(2017, 1, 4), 72000, 100000)

In [4]:
cur.execute('use club')
n = input('Enter name: ')
s = 'select * from movie where MovieName="%s"'%(n,)
cur.execute(s)
v = cur.fetchall()
for j in v:
    print(j)

Enter name: English_Movie
(3, 'English_Movie', 'Horror', datetime.date(2017, 8, 6), 245000, 360000)

In [2]:
import mysql.connector as sqltor
mycon=sqltor.connect(host="localhost",user="root",passwd="Root@123")
cur = mycon.cursor()
cur.execute('Use club')
cur.execute('select * from movie natural join student')
for j in cur:
    print(j)

(4, 'Bengali_Movie', 'Adventure', datetime.date(2017, 1, 4), 72000, 100000, 10, 7, 'Sameer', 'Cricket', 'B', 'Photography', 'A')
(3, 'English_Movie', 'Horror', datetime.date(2017, 8, 6), 245000, 360000, 10, 7, 'Sameer', 'Cricket', 'B', 'Photography', 'A')
(2, 'Tamil_Movie', 'Action', datetime.date(2016, 5, 17), 112000, 118000, 10, 7, 'Sameer', 'Cricket', 'B', 'Photography', 'A')
(1, 'Hindi_Movie', 'Musical', datetime.date(2018, 4, 23), 124500, 130000, 10, 7, 'Sameer', 'Cricket', 'B', 'Photography', 'A')
(4, 'Bengali_Movie', 'Adventure', datetime.date(2017, 1, 4), 72000, 100000, 11, 8, 'Sujit', 'Tennis', 'A', 'Gardening', 'C')
(3, 'English_Movie', 'Horror', datetime.date(2017, 8, 6), 245000, 360000, 11, 8, 'Sujit', 'Tennis', 'A', 'Gardening', 'C')
(2, 'Tamil_Movie', 'Action', datetime.date(2016, 5, 17), 112000, 118000, 11, 8, 'Sujit', 'Tennis', 'A', 'Gardening', 'C')
(1, 'Hindi_Movie', 'Musical', datetime.date(2018, 4, 23), 124500, 130000, 11, 8, 'Sujit', 'Tennis', 'A', 'Gardening', 'C')
(4, 'Bengali_Movie', 'Adventure', datetime.date(2017, 1, 4), 72000, 100000, 12, 7, 'Kamal', 'Swimming', 'B', 'Photography', 'B')
(3, 'English_Movie', 'Horror', datetime.date(2017, 8, 6), 245000, 360000, 12, 7, 'Kamal', 'Swimming', 'B', 'Photography', 'B')
(2, 'Tamil_Movie', 'Action', datetime.date(2016, 5, 17), 112000, 118000, 12, 7, 'Kamal', 'Swimming', 'B', 'Photography', 'B')
(1, 'Hindi_Movie', 'Musical', datetime.date(2018, 4, 23), 124500, 130000, 12, 7, 'Kamal', 'Swimming', 'B', 'Photography', 'B')
(4, 'Bengali_Movie', 'Adventure', datetime.date(2017, 1, 4), 72000, 100000, 13, 7, 'Veena', 'Tennis', 'C', 'Cooking', 'A')
(3, 'English_Movie', 'Horror', datetime.date(2017, 8, 6), 245000, 360000, 13, 7, 'Veena', 'Tennis', 'C', 'Cooking', 'A')
(2, 'Tamil_Movie', 'Action', datetime.date(2016, 5, 17), 112000, 118000, 13, 7, 'Veena', 'Tennis', 'C', 'Cooking', 'A')
(1, 'Hindi_Movie', 'Musical', datetime.date(2018, 4, 23), 124500, 130000, 13, 7, 'Veena', 'Tennis', 'C', 'Cooking', 'A')
(4, 'Bengali_Movie', 'Adventure', datetime.date(2017, 1, 4), 72000, 100000, 14, 9, 'Archana', 'Basket Ball', 'A', 'Literature', 'A')
(3, 'English_Movie', 'Horror', datetime.date(2017, 8, 6), 245000, 360000, 14, 9, 'Archana', 'Basket Ball', 'A', 'Literature', 'A')
(2, 'Tamil_Movie', 'Action', datetime.date(2016, 5, 17), 112000, 118000, 14, 9, 'Archana', 'Basket Ball', 'A', 'Literature', 'A')
(1, 'Hindi_Movie', 'Musical', datetime.date(2018, 4, 23), 124500, 130000, 14, 9, 'Archana', 'Basket Ball', 'A', 'Literature', 'A')
(4, 'Bengali_Movie', 'Adventure', datetime.date(2017, 1, 4), 72000, 100000, 15, 10, 'Arpit', 'Cricket', 'A', 'Gardening', 'C')
(3, 'English_Movie', 'Horror', datetime.date(2017, 8, 6), 245000, 360000, 15, 10, 'Arpit', 'Cricket', 'A', 'Gardening', 'C')
(2, 'Tamil_Movie', 'Action', datetime.date(2016, 5, 17), 112000, 118000, 15, 10, 'Arpit', 'Cricket', 'A', 'Gardening', 'C')
(1, 'Hindi_Movie', 'Musical', datetime.date(2018, 4, 23), 124500, 130000, 15, 10, 'Arpit', 'Cricket', 'A', 'Gardening', 'C')

In [5]:
import mysql.connector as sqltor
mycon=sqltor.connect(host="localhost",user="root",passwd="Root@123")
cur = mycon.cursor()
#cur.execute('create database organization')
cur.execute('use organization')
#cur.execute('create table Employee(Eid int primary key, Name char(20), Depid int, Qualification char(10), Sex char(1))')
cur.execute('create table Salary(Eid int, Foreign key(Eid) references Employee(Eid), Basic int, DA int, HRA int, Bonus int)')

In [7]:
for x in range(6):
    stuno = input('Employee ID: ')
    name = input('Employee Name: ')
    game = input('Dep ID: ')
    grade1 = input('Qualification: ')
    supw = input('Sex: ')
    
    v = 'insert into Employee values("%s", "%s", "%s", "%s", "%s")'%(stuno, name, game, grade1, supw)
    cur.execute(v)
    mycon.commit()
cur.execute('select * from Employee')
for j in cur:
    print(j)

Employee ID: 1
Employee Name: Deepali Gupta
Dep ID: 101
Qualification: MCA
Sex: F
Employee ID: 2
Employee Name: Rajat Tyagi
Dep ID: 101
Qualification: BCA
Sex: M
Employee ID: 3
Employee Name: Hari Mohan
Dep ID: 102
Qualification: B.A.
Sex: M
Employee ID: 4
Employee Name: Harry
Dep ID: 102
Qualification: M.A.
Sex: M
Employee ID: 5
Employee Name: Sumit Mital
Dep ID: 103
Qualification: B.Tech.
Sex: M
Employee ID: 6
Employee Name: Jyoti
Dep ID: 101
Qualification: M.Tech.
Sex: F
(1, 'Deepali Gupta', 101, 'MCA', 'F')
(2, 'Rajat Tyagi', 101, 'BCA', 'M')
(3, 'Hari Mohan', 102, 'B.A.', 'M')
(4, 'Harry', 102, 'M.A.', 'M')
(5, 'Sumit Mital', 103, 'B.Tech.', 'M')
(6, 'Jyoti', 101, 'M.Tech.', 'F')

In [8]:
for x in range(6):
    stuno = input('Employee ID: ')
    name = input('Basic: ')
    game = input('D.A.: ')
    grade1 = input('HRA: ')
    supw = input('Bonus: ')
    print('')
    v = 'insert into Salary values("%s", "%s", "%s", "%s", "%s")'%(stuno, name, game, grade1, supw)
    cur.execute(v)
    mycon.commit()
cur.execute('select * from Salary')
for j in cur:
    print(j)

Employee ID: 1
Basic: 6000
D.A.: 2000
HRA: 2300
Bonus: 200

Employee ID: 2
Basic: 2000
D.A.: 300
HRA: 300
Bonus: 30

Employee ID: 3
Basic: 1000
D.A.: 300
HRA: 300
Bonus: 40

Employee ID: 4
Basic: 1500
D.A.: 390
HRA: 490
Bonus: 30

Employee ID: 5
Basic: 8000
D.A.: 900
HRA: 900
Bonus: 80

Employee ID: 6
Basic: 10000
D.A.: 300
HRA: 490
Bonus: 89

(1, 6000, 2000, 2300, 200)
(2, 2000, 300, 300, 30)
(3, 1000, 300, 300, 40)
(4, 1500, 390, 490, 30)
(5, 8000, 900, 900, 80)
(6, 10000, 300, 490, 89)